namespace Homework__shop__magazine_and_booklist
{/*Задание 1
Ранее в одном из практических заданий вы создавали
класс «Журнал». Добавьте к уже созданному классу информацию о количестве сотрудников. Выполните перегрузку
+ (для увеличения количества сотрудников на указанную
величину), — (для уменьшения количества сотрудников
на указанную величину), == (проверка на равенство количества сотрудников), < и > (проверка на меньше или
больше количества сотрудников), != и Equals. Используйте
механизм свойств для полей класса.
Задание 2
Ранее в одном из практических заданий вы создавали класс «Магазин». Добавьте к уже созданному классу
информацию о площади магазина. Выполните перегрузку + (для увеличения площади магазина на указанную
величину), — (для уменьшения площади магазина на
указанную величину), == (проверка на равенство площадей магазинов), < и > (проверка на меньше или больше
площади магазина), != и Equals. Используйте механизм
свойств для полей класса.
ДОМАШНЕЕ ЗАДАНИЕ
1
Задание 3
Создайте приложение «Список книг для прочтения».
Приложение должно позволять добавлять книги в список, удалять книги из списка, проверять есть ли книга в
списке, и т. д. Используйте механизм свойств, перегрузки
операторов, индексаторов. */
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}
